[
    "There are only 10 types of people in the world: those that understand binary and those that don’t.",
    "Computers make very fast, very accurate mistakes.",
    "Be nice to the nerds, for all you know they might be the next Bill Gates!",
    "Artificial intelligence usually beats real stupidity.",
    "To err is human – and to blame it on a computer is even more so.",
    "CAPS LOCK – Preventing Login Since 1980.",
    "The truth is out there. Anybody got the URL?",
    "The Internet: where men are men, women are men, and children are FBI agents.",
    "Some things Man was never meant to know. For everything else, there’s Google.",
    "The box said ‘Requires Windows Vista or better’. So I installed LINUX.",
    "UNIX is basically a simple operating system, but you have to be a genius to understand the simplicity.",
    "In a world without fences and walls, who needs Gates and Windows?",
    "Bugs come in through open Windows.",
    "Penguins love cold, they wont survive the sun.",
    "Unix is user friendly. It’s just selective about who its friends are.",
    "Failure is not an option. It comes bundled with your Microsoft product.",
    "NT is the only OS that has caused me to beat a piece of hardware to death with my bare hands.",
    "My daily Unix command list: unzip; strip; touch; finger; mount; fsck; more; yes; unmount; sleep.",
    "Microsoft: “You’ve got questions. We’ve got dancing paperclips.”",
    "Erik Naggum: “Microsoft is not the answer. Microsoft is the question. NO is the answer.”",
    "Windows isn’t a virus, viruses do something.",
    "Computers are like air conditioners: they stop working when you open Windows.",
    "Mac users swear by their Mac, PC users swear at their PC.",
    "If at first you don’t succeed; call it version 1.0.",
    "My software never has bugs. It just develops random features.",
    "I would love to change the world, but they won’t give me the source code.",
    "The code that is the hardest to debug is the code that you know cannot possibly be wrong.",
    "Beware of programmers that carry screwdrivers.",
    "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning.",
    "The beginning of the programmer’s wisdom is understanding the difference between getting program to run and having a runnable program.",
    "I’m not anti-social; I’m just not user friendly.",
    "Hey! It compiles! Ship it!",
    "If Ruby is not and Perl is the answer, you don’t understand the question.",
    "The more I C, the less I see.",
    "COBOL programmers understand why women hate periods.",
    "Michael Sinz: “Programming is like sex, one mistake and you have to support it for the rest of your life.”",
    "If you give someone a program, you will frustrate them for a day; if you teach them how to program, you will frustrate them for a lifetime.",
    "Programmers are tools for converting caffeine into code.",
    "My attitude isn’t bad. It’s in beta.",
    "Enter any 11-digit prime number to continue.",
    "E-mail returned to sender, insufficient voltage.",
    "All wiyht. Rho sritched mg kegtops awound?",
    "Black holes are where God divided by zero.",
    "If I wanted a warm fuzzy feeling, I’d antialias my graphics!",
    "If brute force doesn’t solve your problems, then you aren’t using enough.",
    "SUPERCOMPUTER: what it sounded like before you bought it.",
    "Evolution is God’s way of issuing upgrades.",
    "Linus Torvalds: “Real men don’t use backups, they post their stuff on a public ftp server and let the rest of the world make copies.”",
    "Hacking is like sex. You get in, you get out, and hope that you didn’t leave something that can be traced back to you.",
    "There are three kinds of people: those who can count and those who can’t.",
    "Latest survey shows that 3 out of 4 people make up 75% of the world’s population.",
    "Hand over the calculator, friends don’t let friends derive drunk.",
    "An infinite crowd of mathematicians enters a bar. The first one orders a pint, the second one a half pint, the third one a quarter pint… “I understand”, says the bartender – and pours two pints.",
    "1f u c4n r34d th1s u r34lly n33d t0 g37 l41d.",
    "Q. Why are conspiracy theories are like moon landings?\r\nA. Because they\u0027re all fake. ",
    "I put my phone on airplane mode, but it sure ain\u0027t flyin\u0027. ",
    "Do not be racist; be like Mario. He\u0027s an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew! ",
    "Yo momma is so fat, when she sat on an iPod, she made the iPad! ",
    "Reaching the end of a job interview, the Human Resources Officer asks a young engineer fresh out of the Massachusetts Institute of Technology, \"And what starting salary are you looking for?\" The engineer replies, \"In the region of $125,000 a year, depending on the benefits package.\" The interviewer inquires, \"Well, what would you say to a package of five weeks vacation, 14 paid holidays, full medical and dental, company matching retirement fund to 50% of salary, and a company car leased every two years, say, a red Corvette?\" The engineer sits up straight and says, \"Wow! Are you kidding?\" The interviewer replies, \"Yeah, but you started it.\" ",
    "Q: Why couldn\u0027t the blonde add 10 + 5 on a calculator? \r\nA: She couldn\u0027t find the \"10\" button. ",
    "Your momma is so stupid she put airbags on her computer in case it crashed. ",
    "Yo momma so fat when she registered for MySpace there was no space left. ",
    "Q: What do computers eat for a snack? \r\nA: Microchips! ",
    "I named my hard drive \"dat ass,\" so once a month my computer asks if I want to \"back dat ass up.\" ",
    "Mother: \"Sweetie, make a Christmas wish.\" \r\nGirl: \"I wish that Santa will send some clothes to those naked girls in papa\u0027s computer.\" ",
    "The energizer bunny was arrested on a charge of battery. ",
    "Q: What computer sings the best? \r\nA: A Dell. ",
    "Q: What\u0027s Forrest Gumps password? \r\nA: 1forrest1 ",
    "Q: How can you tell if a blonde used a computer? \r\nA: There\u0027s Wite-Out all over the screen. ",
    "What does an air conditioner have in common with a computer? They both lose efficiency as soon as you open windows. ",
    "Q: What did the spider do on the computer? \r\nA: Made a website! ",
    "Does anyone remember the Swatch, a watch made in Switzerland? Thank god Croatia didn\u0027t come up with the idea first. Just imagine if someone were to ask you what time is it? \"Oh pardon me while I look at my crotch.\" ",
    "Me: Siri, where is the best place to hide a body?\r\nSiri: The second page of a Google search. ",
    "I decided to make my password \"incorrect\" because if I type it in wrong, my computer will remind me, \"Your password is incorrect.\" ",
    "Three guys are sitting in a sauna: a Mexican, an Asian, and a white guy. The Mexican and white guy are showing off their new tech gadgets. The white guy says, \"Hey, look what I got: the new Google Glass!\" The Mexican \u0026 Asian say, \"Wow, that\u0027s nice, man.\" Then the Mexican guy says, \"Check out my new cellphone; it\u0027s a watch!\" The white guy and Asian say, \"Very cool, dude.\" The Asian guy has nothing to show these guys, so he gets up and walks away naked to to the bathroom. Then he comes back 5 minutes later from the bathroom still naked with paper hanging out of his butt crack. The Mexican and white guy say, \"Hey, you have something hanging out of your ass.\" The Asian guy says, \"Oh look, I\u0027m receiving a Fax!\" ",
    "Q: Why shouldn\u0027t Facebook have paid $1 billion dollars for Instagram? \r\nA: They could\u0027ve downloaded it for free! ",
    "Q: What did the computer do at lunchtime?\r\nA: Had a byte! ",
    "Yo mamma is so fat that when she sat on a laptop, the hardware turned into software! ",
    "Q: How easy is it to count in binary? \r\nA: Its as easy as 01 10 11. ",
    "Q: How many light bulbs does it take to change a light bulb? A: They can\u0027t; they\u0027re not bright enough. ",
    "1. There are 10 types of people in the world: those who understand binary, and those who don\u0027t.",
    "2. How many programmers does it take to change a light bulb? \r\nNone. It\u0027s a hardware problem.",
    "3. A SEO couple had twins. For the first time they were happy with duplicate content.",
    "5. Why do they call it hyper text? \r\nToo much JAVA.",
    "7. In order to understand recursion you must first understand recursion.",
    "11. Why did the geek add body { padding-top: 1000px; } to his Facebook profile? \r\nHe wanted to keep a low profile.",
    "13. I would tell you a UDP joke, but you might not get it.",
    "Yo momma is so fat, I took a picture of her last Christmas and it\u0027s still printing. ",
    "Reporter: \"Excuse me, may I interview you?\" \r\nMan: \"Yes!\" \r\nReporter: \"Name?\" \r\nMan: \"Abdul Al-Rhazim.\" \r\nReporter: \"Sex?\" \r\nMan: \"Three to five times a week.\" \r\nReporter: \"No no! I mean male or female?\" \r\nMan: \"Yes, male, female... sometimes camel.\" \r\nReporter: \"Holy cow!\" \r\nMan: \"Yes, cow, sheep... animals in general.\" \r\nReporter: \"But isn\u0027t that hostile?\" \r\nMan: \"Yes, horse style, dog style, any style.\" \r\nReporter: \"Oh dear!\" \r\nMan: \"No, no deer. Deer run too fast. Hard to catch.\" ",
    "I asked a Chinese girl for her number. She said, \"Sex! Sex! Sex! Free sex tonight!\" I said, \"Wow!\" Then her friend said, \"She means 666-3629.\" ",
    "Yo momma is so fat when she got on the scale it said, \"I need your weight not your phone number.\" ",
    "Teacher: \"Kids, what does the chicken give you?\"\r\nStudent: \"Meat!\"\r\nTeacher: \"Very good! Now what does the pig give you?\"\r\nStudent: \"Bacon!\"\r\nTeacher: \"Great! And what does the fat cow give you?\"\r\nStudent: \"Homework!\" ",
    "Yo mamma is so ugly when she tried to join an ugly contest they said, \"Sorry, no professionals.\" ",
    "Do not be racist; be like Mario. He\u0027s an Italian plumber, who was made by the Japanese, speaks English, looks like a Mexican, jumps like a black man, and grabs coins like a Jew! ",
    "My friend thinks he is smart. He told me an onion is the only food that makes you cry, so I threw a coconut at his face. ",
    "A black Jewish boy runs home from school one day and asks his father, Daddy, am I more Jewish or more black? The dad replies, Why do you want to know, son? Because a kid at school is selling a bike for $50 and I want to know if I should talk him down to $40 or just steal it! ",
    "Yo momma is so fat that when she went to the beach a whale swam up and sang, \"We are family, even though you\u0027re fatter than me.\" ",
    "Yo momma\u0027s so fat and old when God said, \"Let there be light,\" he asked your mother to move out of the way. ",
    "Yo momma\u0027s so fat, that when she fell, no one was laughing but the ground was cracking up. ",
    "Why does Beyonc?? sing \"to the left, to the left\"? Because black people have no rights! ",
    "Yo momma is so fat that Dora can\u0027t even explore her! ",
    "What is a Mexican\u0027s favorite sport? Cross-country. ",
    "A child asked his father, \"How were people born?\" So his father said, \"Adam and Eve made babies, then their babies became adults and made babies, and so on.\" The child then went to his mother, asked her the same question and she told him, \"We were monkeys then we evolved to become like we are now.\" The child ran back to his father and said, \"You lied to me!\" His father replied, \"No, your mom was talking about her side of the family.\" ",
    "On the roof of a very tall building are four men; one is asian, one is mexican, one is black, and the last one is white. The asian walks to the ledge and says, \"This is for all my people\" and jumps off the roof. Next, the mexican walks to the ledge and also says, \"This is for all my people\" and then he jumps off the roof. Next is the black guy\u0027s turn. The black guy walks to the ledge and says, \"This is for all my people\" and then throws the white guy off the roof. ",
    "There is a black man, a white man, and a Mexican man on a plane that is too heavy to fly and they are about to crash. They each have to throw something off the plane to save them from crashing. The black man throws out his Jordan shoes and says, \"We have too many in our country. The Mexican tosses out his lawn mower and says, \"We have too many in our country. The white man puts his item down, grabs the Mexican, throws him out the window and says, \"We have too many in our country. ",
    "A black boy walks into the kitchen where his mother is baking and accidentally pulls the flour over onto his head. He turns to his mother and says, Look Mama, Im a white boy! His mother smacks him and says, Go tell your Daddy what you just said! The boy finds his father and says, Look Daddy, Im a white boy! His Daddy bends him over, spanks him, stands the boy back up, and says, Now, what do you have to say for yourself? The boy replies, Ive only been a white boy for five minutes and I already hate you black people! ",
    "Yo momma is so fat when she sat on WalMart, she lowered the prices. ",
    "A family is at the dinner table. The son asks the father, Dad, how many kinds of boobs are there? The father, surprised, answers, Well, son, a woman goes through three phases. In her 20s, a womans breasts are like melons, round and firm. In her 30s and 40s, they are like pears, still nice, hanging a bit. After 50, they are like onions. Onions? the son asks. Yes. You see them and they make you cry. This infuriated his wife and daughter. The daughter asks, Mom, how many different kinds of willies are there? The mother smiles and says, Well, dear, a man goes through three phases also. In his 20s, his willy is like an oak tree, mighty and hard. In his 30s and 40s, its like a birch, flexible but reliable. After his 50s, its like a Christmas tree. A Christmas tree? the daughter asks. Yes, dead from the root up and the balls are just for decoration. ",
    "Yo momma is so stupid when an intruder broke into her house, she ran downstairs, dialed 9-1-1 on the microwave, and couldn\u0027t find the \"CALL\" button. ",
    "Q: What nails do carpenters hate to hit? \r\nA: Fingernails. ",
    "A teacher is teaching a class and she sees that Johnny isn\u0027t paying attention, so she asks him, \"If there are three ducks sitting on a fence, and you shoot one, how many are left?\" Johnny says, \"None.\" The teacher asks, \"Why?\" Johnny says, \"Because the shot scared them all off.\" The teacher says, \"No, two, but I like how you\u0027re thinking.\" Johnny asks the teacher, \"If you see three women walking out of an ice cream parlor, one is licking her ice cream, one is sucking her ice cream, and one is biting her ice cream, which one is married?\" The teacher says, \"The one sucking her ice cream.\" Johnny says, \"No, the one with the wedding ring, but I like how you\u0027re thinking!\" ",
    "Q: What did the duck say when he bought lipstick?\r\nA: \"Put it on my bill.\" ",
    "There was a redneckwho hit every black man he saw with his truck. One day he saw a priest walking down the road and thought, \"For all the bad things I done, let me give this priest a ride.\" So he picked the priest up and they drove along. The redneck saw a black guy down the road and decided he would pretend to fall asleep and so the priest would think it was an accident. The redneck closed his eyes and heard a loud bang. \"What happened?\" he asked. \"You missed him,\" the priest said, \"but I got him with the door.\" ",
    "How do you blindfold a Chinese person? Put floss over their eyes. ",
    "A black guy walks into a bar with a parrot on his shoulder and asks for a beer. The bartender brings a beer and notices the parrot on his shoulder and says, \"Hey that\u0027s really neat. Where did you get it?\" The parrot responds, \"In the jungle, there\u0027s millions of them.\" ",
    "Q: Is Google male or female? \r\nA: Female, because it doesn\u0027t let you finish a sentence before making a suggestion. ",
    "A mother is in the kitchen making dinner for her family when her daughter walks in. Mother, where do babies come from? The mother thinks for a few seconds and says, Well dear, Mommy and Daddy fall in love and get married. One night they go into their bedroom, they kiss and hug, and have sex. The daughter looks puzzled so the mother continues, That means the daddy puts his penis in the mommys vagina. Thats how you get a baby, honey. The child seems to comprehend. Oh, I see, but the other night when I came into your room you had daddys penis in your mouth. What do you get when you do that? Jewelry, my dear. Jewelry. ",
    "Q: How does a black girl tell if she is pregnant? A: When she pulls the tampon out all the cotton is picked. ",
    "Teacher: \"If I gave you 2 cats and another 2 cats and another 2, how many would you have?\"\r\nJohnny: \"Seven.\"\r\nTeacher: \"No, listen carefully... If I gave you two cats, and another two cats and another two, how many would you have?\"\r\nJohnny: \"Seven.\"\r\nTeacher: \"Let me put it to you differently. If I gave you two apples, and another two apples and another two, how many would you have?\"\r\nJohnny: \"Six.\"\r\nTeacher: \"Good. Now if I gave you two cats, and another two cats and another two, how many would you have?\"\r\nJohnny: \"Seven!\"\r\nTeacher: \"Johnny, where in the heck do you get seven from?!\"\r\nJohnny: \"Because I\u0027ve already got a freaking cat!\" ",
    "Mr. and Mrs. Brown had two sons. One was named Mind Your Own Business \u0026 the other was named Trouble. One day the two boys decided to play hide and seek. Trouble hid while Mind Your Own Business counted to one hundred. Mind Your Own Business began looking for his brother behind garbage cans and bushes. Then he started looking in and under cars until a police man approached him and asked, \"What are you doing?\" \"Playing a game,\" the boy replied. \"What is your name?\" the officer questioned. \"Mind Your Own Business.\" Furious the policeman inquired, \"Are you looking for trouble?!\" The boy replied, \"Why, yes.\" ",
    "Your momma is so ugly she made One Direction go another direction. ",
    "Q: Would a white or black kindergartner have a bigger dick? \r\nA: The black one because he\u0027s 20. ",
    "Yo momma is so fat her bellybutton gets home 15 minutes before she does. ",
    "What happens to a frog\u0027s car when it breaks down?\r\nIt gets toad away. ",
    "Got tasered picking up my friend from the airport today. Apparently security doesn\u0027t like it when you shout, \"Hi Jack!\" ",
    "Why did I get divorced? Well, last week was my birthday. My wife didn\u0027t wish me a happy birthday. My parents forgot and so did my kids. I went to work and even my colleagues didn\u0027t wish me a happy birthday. As I entered my office, my secretary said, \"Happy birthday, boss!\" I felt so special. She asked me out for lunch. After lunch, she invited me to her apartment. We went there and she said, \"Do you mind if I go into the bedroom for a minute?\" \"Okay,\" I said. She came out 5 minutes later with a birthday cake, my wife, my parents, my kids, my friends, \u0026 my colleagues all yelling, \"SURPRISE!!!\" while I was waiting on the sofa... naked. ",
    "Yo momma\u0027s so stupid, she put two quarters in her ears and thought she was listening to 50 Cent. ",
    "If you think nobody cares you are alive, try missing a couple of payments. ",
    "A little girl and boy are fighting about the differences between the sexes, and which one is better. Finally, the boy drops his pants and says, Heres something I have that youll never have! The little girl is pretty upset by this, since it is clearly true, and runs home crying. A while later, she comes running back with a smile on her face. She drops her pants and says, My mommy says that with one of these, I can have as many of those as I want! ",
    "Kid 1: \"Hey, I bet you\u0027re still a virgin.\" \r\nKid 2: \"Yeah, I was a virgin until last night .\" \r\nKid 1: \"As if.\" \r\nKid 2: \"Yeah, just ask your sister.\" \r\nKid 1: \"I don\u0027t have a sister.\" \r\nKid 2: \"You will in about nine months.\" ",
    "Maria went home happy, telling her mother about how she earned $20 by climbing a tree. Her mom responded, \"Maria, they just wanted to see your panties!\" Maria replied, \"See Mom, I was smart, I took them off!\" ",
    "Yo momma is so stupid she climbed over a glass wall to see what was on the other side. ",
    "Roses are red. \r\nYour blood is too. \r\nYou look like a monkey \r\nAnd belong in a zoo. \r\nDo not worry, \r\nI\u0027ll be there too. \r\nNot in the cage, \r\nBut laughing at you. ",
    "Q: Why do black people smell? A: So blind people can hate them too. ",
    "Yo mama so ugly when she went into a haunted house she came out with a job application. ",
    "Don\u0027t be racist; racism is a crime; and crime is for black people. ",
    "Yo momma so stupid she stuck a battery up her ass and said, \"I GOT THE POWER!\" "
]
